Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.analysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.name
The name of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.calculated
This indicates whether the cross section values have been calculated.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.a
The cross section area (m2) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.avy
The shear area for loads parallel to the Y-axis (m2) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.avz
The shear area for loads parallel to the Z-axis (m2) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.it
The torsion moment (m4) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.iw
The warping constant (m6) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.iy
The radius of gyration about Y-axis (m) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.iyy
The moment of inertia about Y-axis (m4) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.iz
The radius of gyration about Z-axis (m) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.izz
The moment of inertia about Z-axis (m4) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.wyy
The elastic modulus about Y-axis (m3) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.wzz
The elastic modulus about Z-axis (m3) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.wplyy
The plastic modulus about Y-axis (m3) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.wplzz
The plastic modulus about Z-axis (m3) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.g
The mass per unit of length (kg/m) of the analysis cross section.